In [1]:
import pandas as pd

In [2]:
dict1 = {'Name' : ['Priyang', 'Aadhya', 'Krishna','Vedant','Parshv',
                   'Mittal', 'Swarali'],
         'Marks' : [98,89,87,99,90,83,99],
         'Gender' : ['Male','Female','Female','Male','Male',
                     'Female','Female']
        }

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     87  Female
3   Vedant     99    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Swarali     99  Female

In [3]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [4]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [5]:
df1.sort_values(by='Marks')

      Name  Marks  Gender
5   Mittal     83  Female
2  Krishna     87  Female
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
3   Vedant     99    Male
6  Swarali     99  Female

In [11]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
3   Vedant     99    Male
6  Swarali     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
2  Krishna     87  Female
5   Mittal     83  Female

In [12]:
df1.sort_values(by=['Marks','Gender'], ascending=False)

      Name  Marks  Gender
3   Vedant     99    Male
6  Swarali     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
2  Krishna     87  Female
5   Mittal     83  Female

In [16]:
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     87
5   Mittal     83
6  Swarali     99

In [18]:
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     87
5   Mittal     83
6  Swarali     99